# OrdinateDimSetting Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..OrdinateDimSetting Property
ParameterTypeId Class See Also
---
"Ordinate Dimension Settings"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId OrdinateDimSetting { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OrdinateDimSetting As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ OrdinateDimSetting {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace